Yii/frontend/widgets/tag/TagWidget.php

SELECT * FROM `tags` ORDER BY `news_num` DESC LIMIT 20
---
    public function run()
    {
        $res = Tags::find()
            ->orderBy(['news_num'=>SORT_DESC])
            ->limit($this->limit)
            ->all();