Yii/frontend/widgets/hot/HotWidget.php

SELECT `a`.`browser`, `b`.`id`, `b`.`title` FROM `news_extends` `a` LEFT JOIN `news` `b` ON a.news_id = b.id WHERE b.is_valid = 0 ORDER BY `browser` DESC, `id` DESC LIMIT 8
---
    public function run()
    {
        $res = (new Query())
            ->select('a.browser, b.id, b.title')
            ->from(['a'=>NewsExtends::tableName()])
            ->join('LEFT JOIN',['b'=>News::tableName()],'a.news_id = b.id')
            ->where('b.is_valid = 0')
            ->orderBy('browser DESC, id DESC')
            ->limit($this->limit)
            ->all();