Yii/common/models/NewsExtends.php

SELECT * FROM `news_extends` WHERE `news_id`='5'
UPDATE `news_extends` SET `browser`=`browser`+1 WHERE `id`=4
---
    public function upCounter($cond, $attibute, $num)
    {
        $conter = $this->findOne($cond);
        if (!$conter){
            $this->setAttributes($cond);
            $this->$attibute = $num;
            $this->save();
        }else{
            $countData[$attibute] = $num;
            $conter->updateCounters($countData);