Yii/frontend/models/FeedForm.php

    public function getList()
    {
        $model = new Feeds();
        $res = $model->find()->limit(10)->with('user')->orderBy(['id'=>SORT_DESC])->asArray()->all();
---
SELECT * FROM `feeds` ORDER BY `id` DESC LIMIT 10
SELECT * FROM `user` WHERE `id`='1'