Yii/frontend/models/NewsForm.php

SELECT * FROM `news_extends` WHERE `news_id`='5'
SELECT * FROM `news` WHERE `id`='5'
---
    public function getViewById($id){
       $res = News::find()->with('relate.tag','extend')->where(['id'=>$id])->asArray()->one();